Revit 2026 API

# IIFCEntityTreeUIServer Interface

---

The interface used to provide UI on IFC Entity selection.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IIFCEntityTreeUIServer : IExternalServer
```
```vb
Public Interface IIFCEntityTreeUIServer
	Inherits IExternalServer
```
```cpp
public interface class IIFCEntityTreeUIServer : IExternalServer
```
```fsharp
type IIFCEntityTreeUIServer =
    interface
        interface IExternalServer
    end
```

The IIFCEntityTreeUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | ShowDialog | Shows dialog on managing IFCEntityTreeUI. |

#### Reference

Autodesk.Revit.UI Namespace